package com.naver.erp;

import java.util.List;
import java.util.Map;


public interface BoardDAO {
	
	//******************************************
	// [검색한 게시판 목록] 리턴하는 메소드 선언
	//******************************************
	//List<Map<String,String>> getNoticeList( );

	List<Map<String,String>> getBoardList( BoardSearchDTO boardSearchDTO );
	
	
	//******************************************
	// [검색한 게시판 목록]의 총개수 리턴하는 메소드 선언
	//******************************************
	int  getBoardListTotCnt( BoardSearchDTO boardSearchDTO );

	//******************************************
	// [게시판 목록]의 총개수 리턴하는 메소드 선언
	//******************************************
	int  getBoardListAllTotCnt(  );


	//****************************************************
	// [게시판 글 입력 후 입력 적용 행의 개수] 리턴하는 메소드 선언
	//****************************************************
	int insertBoard(BoardDTO boardDTO);


	
	//**************************************************** 
	// 조회수를 1 증가하고 업데이트한 행의 개수를 얻는 메소드 선언
	//****************************************************
	int updateReadcount(int b_no);	

	//****************************************************
	// [1개의 게시판 정보]를 리턴하는 메소드 선언
	//****************************************************
	BoardDTO getBoard(int b_no);

	//**************************************************** 
	// 수정/삭제할 게시판의 존재 개수를 리턴하는 메소드 선언
	//****************************************************
	int getBoardCnt(int b_no);


	//**************************************************** 
	// 게시판 수정 명령한 후 수정 적용행의 개수를 리턴하는 메소드 선언
	//****************************************************
	int updateBoard(BoardDTO board);
	
	//****************************************************
	// [게시판 삭제 명령한 후 삭제 적용행의 개수]를 얻는 메소드 선언
	//****************************************************
	int deleteBoard(BoardDTO board);
	
	
	
} //public interface BoardDAO { 끝
