package com.naver.erp;

import java.util.List;
import java.util.Map;

public interface EmployeeDAO {
	/*
	//******************************************
	// [검색한 게시판 목록] 리턴하는 메소드 선언
	//******************************************
	List<Map<String,String>> getEmpList( );
	*/
	
	//******************************************
	// [검색한 게시판 목록] 리턴하는 메소드 선언
	//******************************************
	List<Map<String,String>> getEmpList( EmployeeSearchDTO 	employeeSearchDTO );
	
	//****************************************************
	// [1개의 게시판 정보]를 리턴하는 메소드 선언
	//****************************************************
	EmployeeDTO getEmployee(int emp_no);
	
	
	
	//**********************************
	// [검색한 게시판 목록]의 총개수 리턴하는 메소드 선언
	//**********************************
	int getEmpListTotCnt(EmployeeSearchDTO 	employeeSearchDTO );

	//**********************************
	// [게시판 목록]의 총 개수 리턴하는 메소드 선언
	//**********************************
	int getEmpListAllTotCnt();

	
	
	//****************************************************
	// [게시판 글 입력 후 입력 적용 행의 개수] 리턴하는 메소드 선언
	//****************************************************
	int insertEmp(EmployeeDTO employeeDTO);
	
	//**************************************************** 
	// 수정/삭제할 게시판의 존재 개수를 리턴하는 메소드 선언
	//****************************************************
	int getEmpCnt(int emp_no);
	
	

	//**************************************************** 
	// 게시판 수정 명령한 후 수정 적용행의 개수를 리턴하는 메소드 선언
	//****************************************************
	int updateEmp(EmployeeDTO employee);
	
	//****************************************************
	// [게시판 삭제 명령한 후 삭제 적용행의 개수]를 얻는 메소드 선언
	//****************************************************
	int deleteEmp(EmployeeDTO employee);

	List<Map<String,String>> getMgrList(EmployeeDTO employeeDTO) ;

	//**************************************************** 
	// 사원중복체크 적용행의 개수를 리턴하는 메소드 선언
	//****************************************************
	int check_emp_no(EmployeeDTO employee);

	
} //public interface EmployeeDAO { 끝


